#include <iostream>
#include <stdio.h>
#include <algorithm>
using namespace std;

int main()
{

    int a[20]={3,5,6,7,8,2,11,344,65,75,65,75,32,22,11,45,29,93,92,100};
    //冒泡排序：稳定排序
    //冒泡排序基本思想:将n个记录看作按纵向排列，每趟排序时自下至上对每对相邻记录进行比较，若次序不符合要求（逆序）就交换。每趟排序结束时都能使排序范围内关键字最小的记录象一个气泡一样升到表上端的对应位置，整个排序过程共进行n-1趟，依次将关键字最小、次小、第三小…的各个记录“冒到”表的第一个、第二个、第三个… 位置上。
    for(int i=0;i<19;i++)
        for(int j=19;j>=i;j--)
            if(a[i]>a[j]) swap(a[i],a[j]);
    for(int i=0;i<20;i++)
        cout<<a[i]<<endl;
    cout<<endl;


    //插入排序：稳定排序
    int b[20]={3,5,6,7,8,2,11,344,65,75,65,75,32,22,11,45,29,93,92,100};
    for(int i=1;i<20;i++)
    {
        if(b[i-1]>b[i]);
        {
            int temp=b[i];
            int j=i;
            while(j>0&&b[j-1]>temp)
            {
                b[j]=b[j-1];
                j--;
            }
            b[j]=temp;
        }
    }
    for(int i=0;i<20;i++)
        cout<<a[i]<<endl;



    //归并排序：稳定排序
    //基数排序：稳定排序
    //快速排序：不稳定排序
    //选择排序：不稳定排序
    //堆排序：不稳定排序
    return 0;
}
